    DataFrame'de Birleştirme ve Bağlama

In [ ]:
#DataFrame birleştirme ( merge ).
#DataFrame bağlama ( concat).

#Ek Metotlar:
"""
df.join() (DataFrame’leri indeksler üzerinden birleştirme)
df.combine_first() (eksik değerleri diğer DataFrame ile doldurma)
"""

In [1]:
import pandas as pd

In [9]:
customers={
    'CustomerId':[1,2,3,4],
    'FirstName':["Ahmet","Ali","Hasan","Canan"],
    'LastName':["Yılmaz","Korkmaz","Çelik","Toprak"]
}

In [5]:
orders={
    'OrderId':[10,11,12,13],
    'CustomerId':[1,2,5,7],
    'OrderDate':['2010-07-04','2010-08-04','2010-07-07','2012-07-04']
}

In [10]:
df_customers=pd.DataFrame(customers,columns=["CustomerId","FirstName","LastName"])
df_orders=pd.DataFrame(orders,columns=["OrderId","CustomerId","OrderDate"])

In [11]:
print(df_customers)

   CustomerId FirstName LastName
0           1     Ahmet   Yılmaz
1           2       Ali  Korkmaz
2           3     Hasan    Çelik
3           4     Canan   Toprak

In [8]:
print(df_orders)

   OrderId  CustomerId   OrderDate
0       10           1  2010-07-04
1       11           2  2010-08-04
2       12           5  2010-07-07
3       13           7  2012-07-04

In [ ]:
#merge(), iki veya daha fazla DataFrame’i birleştirir. SQL’deki JOIN işlemi gibi çalışır. 
#İki DataFrame’i belirli bir sütun ya da indeks üzerinde birleştirmek için kullanılır.

In [12]:
result=pd.merge(df_customers,df_orders,how="inner")
result

   CustomerId FirstName LastName  OrderId   OrderDate
0           1     Ahmet   Yılmaz       10  2010-07-04
1           2       Ali  Korkmaz       11  2010-08-04

In [14]:
result=pd.merge(df_customers,df_orders,how="left")
result

   CustomerId FirstName LastName  OrderId   OrderDate
0           1     Ahmet   Yılmaz     10.0  2010-07-04
1           2       Ali  Korkmaz     11.0  2010-08-04
2           3     Hasan    Çelik      NaN         NaN
3           4     Canan   Toprak      NaN         NaN

In [15]:
result=pd.merge(df_customers,df_orders,how="right")
result

   CustomerId FirstName LastName  OrderId   OrderDate
0           1     Ahmet   Yılmaz       10  2010-07-04
1           2       Ali  Korkmaz       11  2010-08-04
2           5       NaN      NaN       12  2010-07-07
3           7       NaN      NaN       13  2012-07-04

In [22]:
result=pd.merge(df_customers,df_orders,how="outer")
result

   CustomerId FirstName LastName  OrderId   OrderDate
0           1     Ahmet   Yılmaz     10.0  2010-07-04
1           2       Ali  Korkmaz     11.0  2010-08-04
2           3     Hasan    Çelik      NaN         NaN
3           4     Canan   Toprak      NaN         NaN
4           5       NaN      NaN     12.0  2010-07-07
5           7       NaN      NaN     13.0  2012-07-04

In [16]:
customersA={
    'CustomerId':[1,2,3,4],
    'FirstName':["Ahmet","Ali","Hasan","Canan"],
    'LastName':["Yılmaz","Korkmaz","Çelik","Toprak"]
}

In [17]:
customersB={
    'CustomerId':[4,5,6,7],
    'FirstName':["Yağmur","Çınar","Cengiz","Can"],
    'LastName':["Bilge","Turan","Yılmaz","Turan"]
}

In [18]:
df_customersA=pd.DataFrame(customersA,columns=["CustomerId","FirstName","LastName"])
df_customersB=pd.DataFrame(customersB,columns=["CustomerId","FirstName","LastName"])

In [ ]:
#concat() ile indeksleri sıfırlamak için ignore_index=True kullan.
#Sütun bazında birleştirme için axis=1 ayarlanabilir.

In [20]:
result=pd.concat([df_customersA,df_customersB])
result

   CustomerId FirstName LastName
0           1     Ahmet   Yılmaz
1           2       Ali  Korkmaz
2           3     Hasan    Çelik
3           4     Canan   Toprak
0           4    Yağmur    Bilge
1           5     Çınar    Turan
2           6    Cengiz   Yılmaz
3           7       Can    Turan

In [21]:
result=pd.concat([df_customersA,df_customersB],axis=1)
result

   CustomerId FirstName LastName  CustomerId FirstName LastName
0           1     Ahmet   Yılmaz           4    Yağmur    Bilge
1           2       Ali  Korkmaz           5     Çınar    Turan
2           3     Hasan    Çelik           6    Cengiz   Yılmaz
3           4     Canan   Toprak           7       Can    Turan

In [ ]:
#concat(): DataFrame’leri satır veya sütun olarak birleştirir.
#append(): Bir DataFrame’i diğerine ekler. Yeni DataFrame döndürür (2022 itibariyle concat öneriliyor).